MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX256VLQ10/mcu.h
#define LCD_GCR                       (*((volatile uint32_t *)0x400BE000))      // LCD General Control Register (LCD_GCR)
#define LCD_AR                        (*((volatile uint32_t *)0x400BE004))      // LCD Auxiliary Register (LCD_AR)
#define LCD_FDCR                      (*((volatile uint32_t *)0x400BE008))      // LCD Fault Detect Control Register (LCD_FDCR)
#define LCD_FDSR                      (*((volatile uint32_t *)0x400BE00C))      // LCD Fault Detect Status Register (LCD_FDSR)
#define LCD_PENL                      (*((volatile uint32_t *)0x400BE010))      // LCD Pin Enable register (LCD_PENL)
#define LCD_PENH                      (*((volatile uint32_t *)0x400BE014))      // LCD Pin Enable register (LCD_PENH)
#define LCD_BPENL                     (*((volatile uint32_t *)0x400BE018))      // LCD Back Plane Enable register (LCD_BPENL)
#define LCD_BPENH                     (*((volatile uint32_t *)0x400BE01C))      // LCD Back Plane Enable register (LCD_BPENH)
#define LCD_WF3TO0                    (*((volatile uint32_t *)0x400BE020))      // LCD Waveform register (LCD_WF3TO0)
#define LCD_WF7TO4                    (*((volatile uint32_t *)0x400BE024))      // LCD Waveform register (LCD_WF7TO4)
#define LCD_WF11TO8                   (*((volatile uint32_t *)0x400BE028))      // LCD Waveform register (LCD_WF11TO8)
#define LCD_WF15TO12                  (*((volatile uint32_t *)0x400BE02C))      // LCD Waveform register (LCD_WF15TO12)
#define LCD_WF19TO16                  (*((volatile uint32_t *)0x400BE030))      // LCD Waveform register (LCD_WF19TO16)
#define LCD_WF23TO20                  (*((volatile uint32_t *)0x400BE034))      // LCD Waveform register (LCD_WF23TO20)
#define LCD_WF27TO24                  (*((volatile uint32_t *)0x400BE038))      // LCD Waveform register (LCD_WF27TO24)
#define LCD_WF31TO28                  (*((volatile uint32_t *)0x400BE03C))      // LCD Waveform register (LCD_WF31TO28)
#define LCD_WF35TO32                  (*((volatile uint32_t *)0x400BE040))      // LCD Waveform register (LCD_WF35TO32)
#define LCD_WF39TO36                  (*((volatile uint32_t *)0x400BE044))      // LCD Waveform register (LCD_WF39TO36)
#define LCD_WF43TO40                  (*((volatile uint32_t *)0x400BE048))      // LCD Waveform register (LCD_WF43TO40)
#define LCD_WF47TO44                  (*((volatile uint32_t *)0x400BE04C))      // LCD Waveform register (LCD_WF47TO44)
#define LCD_WF51TO48                  (*((volatile uint32_t *)0x400BE050))      // LCD Waveform register (LCD_WF51TO48)
#define LCD_WF55TO52                  (*((volatile uint32_t *)0x400BE054))      // LCD Waveform register (LCD_WF55TO52)
#define LCD_WF59TO56                  (*((volatile uint32_t *)0x400BE058))      // LCD Waveform register (LCD_WF59TO56)
#define LCD_WF63TO60                  (*((volatile uint32_t *)0x400BE05C))      // LCD Waveform register (LCD_WF63TO60)



//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define USBREGEN                      0x80000000      // USB voltage regulator enable
#define USBSSTBY                      0x40000000      // USB voltage regulator in standby mode during Stop, VLPS, LLS and VLLS modes
#define USBVSTBY                      0x20000000      // USB voltage regulator in standby mode during VLPR and VLPW modes
#define Reserved                      0x1FF0000000      // This read-only field is reserved and always has the value 0
#define OSC32KSEL                     0x00180000      // 32K oscillator clock select
#define Reserved                      0x00060000      // This read-only field is reserved and always has the value 0
#define RAMSIZE                       0x00078000      // RAM size
#define Reserved                      0x0001F800      // This read-only field is reserved and always has the value 0
#define Reserved                      0x000007E0      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1CFG register.
//
//*****************************************************************************

#define USSWE                         0x04000000      // USB voltage regulator stop standby write enable
#define UVSWE                         0x02000000      // USB voltage regulator VLP standby write enable
#define URWE                          0x01000000      // USB voltage regulator enable write enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define SDHCSRC                       0x60000000      // SDHC clock source select
#define Reserved                      0x1F8000000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00E00000      // This read-only field is reserved and always has the value 0
#define USBSRC                        0x00040000      // USB clock source select
#define Reserved                      0x00020000      // This read-only field is reserved and always has the value 0
#define PLLFLLSEL                     0x00010000      // PLL/FLL clock select
#define Reserved                      0x00038000      // This read-only field is reserved and always has the value 0
#define TRACECLKSEL                   0x00001000      // Debug trace clock select
#define PTD7PAD                       0x00000800      // PTD7 pad drive strength
#define Reserved                      0x00000400      // This read-only field is reserved and always has the value 0
#define FBSL                          0x00000600      // FlexBus security level
#define CLKOUTSEL                     0x00000380      // CLKOUT select
#define RTCCLKOUTSEL                  0x00000010      // RTC clock out select
#define Reserved                      0x00000078      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define FTM0TRG1SRC                   0x20000000      // FlexTimer 0 Hardware Trigger 1 Source Select
#define FTM0TRG0SRC                   0x10000000      // FlexTimer 0 Hardware Trigger 0 Source Select
#define Reserved                      0x08000000      // This read-only field is reserved and always has the value 0
#define FTM2CLKSEL                    0x04000000      // FlexTimer 2 External Clock Pin Select
#define FTM1CLKSEL                    0x02000000      // FTM1 External Clock Pin Select
#define FTM0CLKSEL                    0x01000000      // FlexTimer 0 External Clock Pin Select
#define Reserved                      0x01800000      // This read-only field is reserved and always has the value 0
#define FTM2CH0SRC                    0x00600000      // FTM2 channel 0 input capture source select
#define FTM1CH0SRC                    0x00180000      // FTM1 channel 0 input capture source select
#define Reserved                      0x03FE0000      // This read-only field is reserved and always has the value 0
#define FTM2FLT0                      0x00000100      // FTM2 Fault 0 Select
#define Reserved                      0x00000380      // This read-only field is reserved and always has the value 0
#define FTM1FLT0                      0x00000010      // FTM1 Fault 0 Select
#define Reserved                      0x00000008      // This read-only field is reserved and always has the value 0
#define FTM0FLT2                      0x00000004      // FTM0 Fault 2 Select
#define FTM0FLT1                      0x00000002      // FTM0 Fault 1 Select
#define FTM0FLT0                      0x00000001      // FTM0 Fault 0 Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define UART1RXSRC                    0x00000180      // UART 1 receive data source select
#define UART1TXSRC                    0x00000060      // UART 1 transmit data source select
#define UART0RXSRC                    0x00000018      // UART 0 receive data source select
#define UART0TXSRC                    0x00000006      // UART 0 transmit data source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

#define ADC1ALTTRGEN                  0x00008000      // ADC1 alternate trigger enable
#define Reserved                      0x0000C000      // This read-only field is reserved and always has the value 0
#define ADC1PRETRGSEL                 0x00001000      // ADC1 pre-trigger select
#define ADC1TRGSEL                    0x00007800      // ADC1 trigger select
#define ADC0ALTTRGEN                  0x00000080      // ADC0 alternate trigger enable
#define Reserved                      0x000000C0      // This read-only field is reserved and always has the value 0
#define ADC0PRETRGSEL                 0x00000010      // ADC0 pre-trigger select
#define ADC0TRGSEL                    0x00000078      // ADC0 trigger select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SDID register.
//
//*****************************************************************************

