MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK40DX256VLQ10/mcu.h
#define AMC                           0x00007F80      // Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_CR register.
//
//*****************************************************************************

#define SRAMLWP                       0x40000000      // SRAM_L Write Protect
#define SRAMLAP                       0x60000000      // SRAM_L arbitration priority
#define SRAMUWP                       0x04000000      // SRAM_U write protect
#define SRAMUAP                       0x06000000      // SRAM_U arbitration priority


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ISR register.
//
//*****************************************************************************

#define DHREQ                         0x00000008      // Debug Halt Request Indicator
#define NMI                           0x00000004      // Non-maskable Interrupt Pending
#define IRQ                           0x00000002      // Normal Interrupt Pending


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCC register.
//
//*****************************************************************************

#define ITDIS                         0x00000020      // ITM-To-TPIU Disable
#define ETDIS                         0x00000010      // ETM-To-TPIU Disable
#define RLRQ                          0x00000008      // Reload Request
#define RSPT                          0x0000000C      // Response Type
#define CNTEN                         0x00000001      // Counter Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBRL register.
//
//*****************************************************************************

#define RELOAD                        0x001FFC00      // Byte Count Reload Value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_ETBCNT register.
//
//*****************************************************************************

#define COUNTER                       0x001FFC00      // Byte Count Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the MCM_PID register.
//
//*****************************************************************************

#define PID                           0x00007F80      // M0_PID And M1_PID For MPU ::


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_PRSn register.
//
//*****************************************************************************

#define M7                            0x1C0000000      // Master 7 Priority. Sets the arbitration priority for this port on the associated slave port
#define M6                            0x1C000000      // Master 6 Priority. Sets the arbitration priority for this port on the associated slave port
#define M5                            0x01C00000      // Master 5 Priority. Sets the arbitration priority for this port on the associated slave port
#define M4                            0x001C0000      // Master 4 Priority. Sets the arbitration priority for this port on the associated slave port
#define M3                            0x0001C000      // Master 3 Priority. Sets the arbitration priority for this port on the associated slave port
#define M2                            0x00001C00      // Master 2 Priority. Sets the arbitration priority for this port on the associated slave port
#define M1                            0x000001C0      // Master 1 Priority. Sets the arbitration priority for this port on the associated slave port
#define M0                            0x0000001C      // Master 0 Priority. Sets the arbitration priority for this port on the associated slave port


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_CRSn register.
//
//*****************************************************************************

#define RO                            0x80000000      // Read Only
#define HLP                           0x40000000      // Halt Low Priority
#define ARB                           0x00000600      // Arbitration Mode
#define PCTL                          0x00000060      // Parking Control
#define PARK                          0x0000001C      // Park


//*****************************************************************************
//
// The following are defines for the bit fields in the AXBS_MGPCRn register.
//
//*****************************************************************************

#define AULB                          0x0000001C      // Arbitrates On Undefined Length Bursts


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_CESR register.
//
//*****************************************************************************

#define SPERR                         0xF80000000      // Slave Port n Error
#define Reserved                      0x00800000      // This read-only field is reserved and always has the value 1
#define Reserved                      0x01C00000      // This read-only field is reserved and always has the value 0
#define HRL                           0x00780000      // Hardware Revision Level
#define NSP                           0x00078000      // Number Of Slave Ports
#define NRGD                          0x00007800      // Number Of Region Descriptors
#define Reserved                      0x00003F80      // This read-only field is reserved and always has the value 0
#define VLD                           0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_EARn register.
//
//*****************************************************************************

#define EADDR                         0x7FFFFFFF80000000      // Error Address


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_EDRn register.
//
//*****************************************************************************

#define EACD                          0x7FFF80000000      // Error Access Control Detail
#define Reserved                      0x007F8000      // This read-only field is reserved and always has the value 0
#define EMN                           0x00000780      // Error Master Number
#define EATTR                         0x00000038      // Error Attributes
#define ERW                           0x00000001      // Error Read/Write


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD0 register.
//
//*****************************************************************************

#define SRTADDR                       0x3FFFFFF80000000      // Start Address
#define Reserved                      0x000001F0      // This read-only field is reserved and always has the value 0


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD1 register.
//
//*****************************************************************************

